eafagerland/STM32F2xx-Scratch/driver/stm32f2xx_esl_rcc.c
/********************************************************************************************
 *  Filename: stm32f2xx_esl_rcc.c
 *  Author: Erik Fagerland
 *  Created On: 14/02/2024
 * 
 *  Brief:
 *  Implementation of the RCC config for MCU. Initializes the MCU clocks
 *  with some error checking.
 * 
 *******************************************************************************************/
#include "stm32f2xx_esl_rcc.h"
#include "stm32f2xx_esl_systick.h"

RCC_System_Clocks RCC_Clocks = {0};

/********************************************************************************************
 *  Transform the AHB enum into an integer correspending to its DIV num.
 *******************************************************************************************/
static UInt16 Get_AHB_Div(RCC_AHB_DIV AHP)
{
    switch (AHP)
    {
        case RCC_AHB_CLOCK_DIV1: return 1;
        case RCC_AHB_CLOCK_DIV2: return 2;
        case RCC_AHB_CLOCK_DIV4: return 4;
        case RCC_AHB_CLOCK_DIV8: return 8;
        case RCC_AHB_CLOCK_DIV16: return 16;
        case RCC_AHB_CLOCK_DIV64: return 64;
        case RCC_AHB_CLOCK_DIV128: return 128;
        case RCC_AHB_CLOCK_DIV256: return 256;
        case RCC_AHB_CLOCK_DIV512: return 512;
    }
}

/********************************************************************************************
 *  Transform the APB enum into an integer correspending to its DIV num.
 *******************************************************************************************/
static UInt16 Get_APB_Div(RCC_APB_DIV APB)
{
    switch (APB)
    {
        case RCC_APBx_CLOCK_DIV1: return 1;
        case RCC_APBx_CLOCK_DIV2: return 2;
        case RCC_APBx_CLOCK_DIV4: return 4;
        case RCC_APBx_CLOCK_DIV8: return 8;
        case RCC_APBx_CLOCK_DIV16: return 16;
    }
}

/********************************************************************************************
 *  Transform the PLLP enum into an integer correspending to its DIV num.
 *******************************************************************************************/
static UInt16 Get_PLLP_Div(RCC_PLLP_DIV PLLP)
{
    switch (PLLP)
    {
        case RCC_PLLP_CLOCK_DIV2: return 2;
        case RCC_PLLP_CLOCK_DIV4: return 4;
        case RCC_PLLP_CLOCK_DIV6: return 6;
        case RCC_PLLP_CLOCK_DIV8: return 8;
    }
}

/********************************************************************************************
 *  Calculates the different clock speeds into an exported variable so they can be accessed
 *  elsewhere for other use.
 *******************************************************************************************/
static void Calculate_RCC_Clocks(RCC_APB_DIV APB1_prescaler, RCC_APB_DIV APB2_prescaler, RCC_AHB_DIV AHB_prescaler)
{
    RCC_Clocks.SYSCLK           = RCC_SYSCLK_TARGET;
    RCC_Clocks.HCLK             = RCC_SYSCLK_TARGET;
    RCC_Clocks.APB1_CLOCK       = (RCC_SYSCLK_TARGET / Get_AHB_Div(AHB_prescaler)) / Get_APB_Div(APB1_prescaler);
    RCC_Clocks.APB1_TIM_CLOCK   = ((RCC_SYSCLK_TARGET / Get_AHB_Div(AHB_prescaler)) / Get_APB_Div(APB1_prescaler) * 2);
    RCC_Clocks.APB2_CLOCK       = (RCC_SYSCLK_TARGET / Get_AHB_Div(AHB_prescaler)) / Get_APB_Div(APB2_prescaler);
    RCC_Clocks.APB2_TIM_CLOCK   = ((RCC_SYSCLK_TARGET / Get_AHB_Div(AHB_prescaler)) / Get_APB_Div(APB2_prescaler) * 2);
}

/********************************************************************************************
 *  Function for testing if the calculated sysclk based on prescaler and crystal matches the
 *  target sysclk defined in header file.
 *******************************************************************************************/
static ESL_StatusTypeDef Is_SYSCLK_OK(UInt16 PLLM_prescaler, UInt16 PLLN_prescaler, RCC_PLLP_DIV PLLP_prescaler)
{
    UInt32 calculated_sysclk = ((RCC_HSE_CRYSTAL_FREQ / PLLM_prescaler) * PLLN_prescaler) / Get_PLLP_Div(PLLP_prescaler);
    if (calculated_sysclk != RCC_SYSCLK_TARGET)
        return ESL_ERROR;
    return ESL_OK;
}

/********************************************************************************************
 *  Initializes the MCU clocks based on given PLL, APB and AHB prescalers.
 *  Also sets the flash latency to 3WS. Returns error if target clock dont match
 *  with settings.
 *  Should be the first thing called in main function!
 *******************************************************************************************/
ESL_StatusTypeDef ESL_RCC_Init
(   
    RCC_PLLP_DIV PLLP_prescaler, 
    UInt16 PLLN_prescaler, 
    UInt16 PLLM_prescaler, 
    UInt16 PLLQ_prescaler, 
    RCC_APB_DIV APB1_prescaler, 
    RCC_APB_DIV APB2_prescaler, 
    RCC_AHB_DIV AHB_prescaler
)
{
/***************************************************************************
*  Set flash interface latency to 3 wait states 
*  (Must be set on higher frequencies. ref table 3 flash programming manual)
*/
    FLASH_INTF->ACR |= (FLASH_LATENCY_3WS << FLASH_ACR_LATENCY_POS);

    RCC->CR |= RCC_CR_HSE_ON;               // Enable HSE
    RCC->CR &= ~RCC_CR_HSI_ON;              // Disable HSI

    while (!(RCC->CR & RCC_CR_HSE_RDY));    // HSE Ready Flag
    //while (!(RCC->CR & RCC_CR_HSi_RDY));  // HSI Ready Flag
    
    RCC->CR &= ~RCC_CR_PLL_ON;              // Disable PLL

    // CLear PLLQ and set new value
    RCC->PLLCFGR &= ~(0b1111UL << RCC_PLLCFGR_PLLQ_POS);
    RCC->PLLCFGR |= (PLLQ_prescaler << RCC_PLLCFGR_PLLQ_POS);          

    // Clear PLL source and set HSE as source
    RCC->PLLCFGR &= ~(1U << RCC_PLLCFGR_PLL_SRC_POS);
    RCC->PLLCFGR |= RCC_PLLCFGR_PLL_SRC_HSE; 

    // Clear PLLP and PLLN
    RCC->PLLCFGR &= ~(0b11UL << RCC_PLLCFGR_PLLP_POS);          
    RCC->PLLCFGR &= ~(0b111111111UL << RCC_PLLCFGR_PLLN_POS);

    // Set PLLP and PLLN
    RCC->PLLCFGR |= (PLLP_prescaler << RCC_PLLCFGR_PLLP_POS);          
    RCC->PLLCFGR |= (PLLN_prescaler << RCC_PLLCFGR_PLLN_POS); 

    // Clear PLLM and set new value
    RCC->PLLCFGR &= ~(0b111111UL);                              
    RCC->PLLCFGR |= (PLLM_prescaler << RCC_PLLCFGR_PLLM_POS);           

    RCC->CR |= RCC_CR_PLL_ON;           // PLL ON

    while (!(RCC->CR & RCC_CR_PLLRDY)); // Wait until PLL is ready

    // Clear APB2 Clock divider and set new value
    RCC->CFGR &= ~(0b111UL << RCC_CFGR_APB2_POS); 
    RCC->CFGR |= (APB2_prescaler << RCC_CFGR_APB2_POS);

    // Clear APB1 Clock divider and set new value
    RCC->CFGR &= ~(0b111UL << RCC_CFGR_APB1_POS);
    RCC->CFGR |= (APB1_prescaler << RCC_CFGR_APB1_POS);

    // Clear AHB Clock divider and set new value
    RCC->CFGR &= ~(0b1111UL << RCC_CFGR_AHB_POS);			
    RCC->CFGR |= (AHB_prescaler << RCC_CFGR_AHB_POS);

    RCC->CFGR &= ~(0x3UL);        // Clear SW bits
    RCC->CFGR |= RCC_CFGR_SW_PLL; // Set PLL as main clock source

    // Enable used perfs on AHB1
    RCC->AHB1ENR |= (RCC_AHB1ENR_GPIOAEN | RCC_AHB1ENR_GPIOBEN | RCC_AHB1ENR_GPIOCEN | RCC_AHB1ENR_GPIODEN);

    // Enable used perfs on APB2
    RCC->APB2ENR |= (RCC_APB2ENR_TIM10EN | RCC_APB2ENR_TIM11EN | RCC_APB2ENR_SYSCFGEN);

    // Enable used perfs on APB1
    RCC->APB1ENR |= (RCC_APB1ENR_USART2EN | RCC_APB1ENR_PWREN);

    // Calculate the current clock values
    Calculate_RCC_Clocks(APB1_prescaler, APB2_prescaler, AHB_prescaler);

    // Check if the current PLL settings matches the target SYSCLK, if not throw error
    if (Is_SYSCLK_OK(PLLM_prescaler, PLLN_prescaler, PLLP_prescaler) != ESL_OK)
        return ESL_ERROR;
    
    return ESL_OK;
}
